Maritime-Devcon/MaritimeDevcon-2019.org
* Introduction
This is a compilations of my notes on the talks I attended at Maritime Devcon 2019
* Session 1: The Good Code
** Info
   - Speaker: Chris Dail
** Summary
Some pointers and tips on what good code is and how to write it.
** Notes:
*** Not good code
Don't repeat code.
Use the right tool.
Broken window effect:
  Bad code causes carelessness.
  Leads to more bad code.
  AKA If it is already bad, you probably won't do much to make it any better.
*** Good Code
**** Qualities of good code
     - Readability
       - Why is this the most important?
         1. you are not the only person that will be reading your code.
         2. Future you will also have to read your code.
         3. Reading vs Writing Code (70% / 30% when developing)
     - Simple
       1. Easily understood
       2. Simple architecture and abstractions (low complexity)
       3. One thing should do one thing
     - No surprises
       - Relates to simplicity.
*** Deadlines
We plan to fix it in the next release, but that doesn't often happen.
Code reviews: don't let more bad code slip through.
*** Quantity vs quality
average 15-50 bugs per 1000 lines of code
Therefore, less code means fewer bugs.
Cannot be done artificially
 - Needs to be readable
 - Quality - Fewer LOC, but make it more meaningful
 - Keep it simple
*** Naming
Names should reveal the intent and have meaningful distinctions, no noisy (redundant) words.
Make it human readable/searchable. Follow conventions.
- Variables/Classes: Nouns
- Methods/Functions: Verbs, be descriptive and don't worry about length.
  - Reading a function name should give you an idea of what it does.
- Libraries/modules: Don't do things like utils, of course it is a util. Use something that describes what it does.
*** Functions
    - Functions should do just one thing.
    - Keep them short (20 lines)
    - Avoid side effects (with global state)
**** Classes and Objects
     - The class should have one theme
     - Single level of abstraction
     - Avoid "Junk Drawer" classes (like a util class)
**** Magic numbers
     - Use constants defined in a single place to enhance readability.
     - Explains what the number is.
**** Comments
     - Explains the intent of the code.
     - Answer why, not what or how.
     - Only add comments when it will enhance readability
     - If you need to write a lot of comments, maybe the code should be refactored.
     - Avoid redundant comments that just say what the code is doing.
     - Avoid misleading comments that lie about what the code is doing.
     - References to bug numbers should not be necessary, use vcs
**** Version Control
     - VC History should be treated like code
       - It should be readable, you should be able to know what the purpose of the commit is from the name.
       - Should read like a story
     - Use Small commits
     - Small PRs
**** Formatting
     - Keep files short
     - keep lines short
     - Low levels of indentation
     - Use whitespace to separate paragraphs of code
     - Vars should be declared close to where they are used.
     - Instance variables at the top of class
**** Error handling
     - Exceptions should be exceptional
     - Behave in reasonable ways instead of throwing errors
       - EX/ Return an empty list when no records found
     - Early return for invalid cases
     - No empty catch blocks
**** Scout Rule
     - Leave it cleaner then when you found it.
**** When in Rome
     - Follow the code style of the codebase you are in
     - Follow the conventions of the language
     - It is important to keep the code consistent.
     - Linters help with this.
**** DRY - Don't repeat yourself
     - Reuse code - Functions, Libraries, classes
     - Redundant comments
     - Multi-developer teams
       - Duplication of validation/util functions
       - Centralize and make reuse easy
       - Always look before you write, someone may have already implemented it.
**** Copy and Paste
     - Creates repetition
       - You can duplicate a bug
     - You may not understand the code being copied.
       - If you don't fully understand the code you may be introducing a new bug
     - Reuse with a function
**** Clever Code
     - Be wary of "clever" code (aka, cute, magic)
     - It is likely hard to read/debug
     - The dull, straightforward way may be boring, but it can be better if it is easy to understand.
     - Keep in mind the level of experience on your team
**** Why is it hard for people to write good code?
     - BBC: Pillars of Computational Thinking
       - Decomposition
       - Abstraction
       - Pattern recognition
       - Algorithms
     - Good code is more art then math
       - Creating code that is easy to read and understand is more art then math
     - Good code tells a story
       - The code describes the application, it describes the purpose.
       - The computer takes it literally, it may work but the computer can't determine the purpose
** Questions
   1. What about WIP commits when you need to switch over to work on something else
      * You can make a WIP commit and don't push it, you can amend it later
      * git stash
   2. What languages make good code easy?
      - Not PHP or VB
      - It depends on the developer
      - Kotlin > Java, you can be more expressive
   3. A lack of understanding causes messier code.
* Session 2: Mesh isn't just for the club (anymore)
** Info
   - Speaker: Josh Cormier
** Summary
An overview of what a mesh network is and how it works. It covers mesh service, control planes, and proxies.
** Notwes:
