Maritime-Devcon/MaritimeDevcon-2019.md


<a id="orga46ba63"></a>

## Notwes:


<a id="org2a3d477"></a>

### Terms

-   What is a distributed system?
    -   A group of related, yet independently resourced processes.
    -   Okay, but why?
        -   Resilience
            -   Fault tolerance
        -   Performance
            -   Horizontal scaling, More throughput
        -   Economics
            -   Scale up individual sections of the system
            -   Scale down lightly use apis
-   Microservices
    -   Services that do not share
        -   Different databases
        -   Not tightly coupled
        -   Can run independant of each other
        -   You should not need to deploy code in a certain order


<a id="org08b5565"></a>

### Problems

-   Coordination issues
    -   race conditions
    -   deadlock
    -   Handling dropped packets/network hostility
-   Deploy without downtime
    -   ability to make changes to specific services without side effects
-   Resilience
-   Configuration
-   Observability
    -   Monitoring
    -   Storage constraints on telemetry data


<a id="org2173341"></a>

### Agnostic configuration

-   A service is able to run regardless of where it is
-   Pulling metrics instead of pushing. (just have an endpoint)
-   Relying on the environment to transport telemetry.
-   examples:
    -   Docker logging to stdout
    -   Prometheus log pulling


<a id="org55d9e06"></a>

### Mesh definition

-   Noun: A weblike pattern or construction
-   Verb: to coordinate closely
-   Service mesh:
    -   Service level
    -   Data plane
    -   Control plane: Configuration, routing where things go.
    -   Service discovery and telemetry.
-   Each application container has a proxy that directs traffic on the mesh.
-   Mesh nodes (proxies) act like a load balancer for how instance a would connect with other instances.


<a id="orgc88c47a"></a>

### Case studies

-   Discoverability: The mesh control plane defines the architecture
-   Retry failure:
    -   4 layers deep with 5 retries at each level
    -   Load overwhelmed the second layer which lead to 5<sup>3</sup> retries per request.
    -   A single error would cause exponential requests
    -   Had to restart to flush queues
    -   How could a mesh have helped?
        -   All communication goes through the service mesh.
        -   Distributed circuit breakers managed by control plane (Stop new requests to a single instance/service to allow recovery)
    -   Resolution:
        -   Tried to disable retries
            -   The fix was in the code, not at the network layer.
        -   With a mesh service the proxy handles the retry logic. The service sends requests to the proxy.
-   Security: Encrypting traffic
    -   Moving from no encryption to having encryption
    -   All communications go through the service mesh, so the tls encryption can be handled without modifying the service or the host.
    -   Zero trust networking
-   New feature roll out
    -   Add now features in a safe manner
    -   Feature flags are okay, but they can be a cause of spaghetti code
        -   Controlling features on a per customer basis,
        -   Negatively effect readability
    -   Service mesh: Traffic distribution
        -   This has the ability to shape traffice
            -   A/B deployments
            -   Percentage based routing
            -   Tenant based routing
            -   Ghost Traffic
                -   Send a mirror traffic to a new version of the service to see how it is handled
                -   The mesh can discard responses from the mirrored service
        -   If there is a failure, not all of the requests are effected.


<a id="org94e2789"></a>

### Problems

-   Latency
    -   Unavoidable
    -   Adds extra hops
-   Resource cost
    -   A proxy is required for every instance of a service
    -   Just managing a mesh service will add resource cost on servers
-   Additional maintenance


<a id="org96d3c4c"></a>

### Where do you start?

1.  Pick a mesh service

    -   There is no industry standard
    -   It is a big investment, you could get locked in

2.  Open standards

    -   Mesh services
        -   SMI <https://smi-spec.io> (for K8s)
    -   Telemetry
        -   Opentelemetry (<https://opentelemetry.io>)


<a id="org26c1d90"></a>

## Questions

1.  What is the resiliency of a mesh?
    -   It depends on your orchestration system
    -   The service should be handling some errors
2.  How do you deploy to clusters?
    -   Helm
3.  Availability concerns of the mesh? What happens if the mesh fails?
    -   You can leave a failover configuration in the service.
    -   The orchestration layer should handle that.
4.  What are your thoughts on the depth of services and apis?
    -   Shouldn't go too deep, maybe 5? Each layer eats time.


<a id="org6747cb4"></a>

# Session 3: CircuitPython: Python on microcontrollers


<a id="org128555c"></a>

## Info

-   speaker: Dave Astels
    -   Freelances for Adafruit


<a id="org58ae881"></a>

## Summary

An overview of the origins of CircuitPython and the type of hardware that it can run on.


<a id="org634decb"></a>

## Notes:


<a id="orge1bc053"></a>

### Where does your code run?

-   Cloud?
-   Desktop?
-   Raspberry pi?
-   Microcontrollers? <&#x2013; YAS


<a id="org6205454"></a>

### microPython

-   It is a from-scratch implementation of Python 3.4 targetting MCUs
-   Supported by Micro:bit
-   Bytecode VM
-   JIT or AOT
-   Targeted for professional developers
    -   Can be awkward to use
    -   Not that easy for kids/teachers/beginners


<a id="orgd480dc5"></a>

### CircuitPython

-   Fork of microPython (By Adafruit)
-   Targetting Microchip/Atmel SAMD21/51
-   Aimed at education, beginners, makers, kids
-   Can be run on Pi with a shim layer
-   Features:
    -   Almost full python implementation, has most of the standard lib
    -   Easy to use
    -   REPL via USB/Serial
    -   MCU/SPI Flash shows up as USB
    -   The VM can auto-restart when files change
    -   Hardware abstractions to bring ease of use (abstract board pins and things like i2c)


<a id="org255e9a6"></a>

### Hardware for CircuitPython

-   Adafruit boards were the first
-   Arduino, Sparkfun, Particle
-   And many other independant boards
-   Some boards:
    -   Teensy M0 (SAMD21)
    -   CircuitPlayground Express (SAMD21)
        -   good for education
        -   has baked in hardware
            -   leds
            -   speaker
            -   ir
            -   alligator clip friendly
    -   Feather M4 Express (SAMD51)
    -   Feather M4 AirLift (SAMD51)
        -   Built-in ESP32 for wifi
    -   PyPortal (SAMD51)
        -   Also has ESP32 for Wifi
        -   The bottom side is a tft touchscreen (<https://www.adafruit.com/product/4116>)
    -   MetroM4 Grand Central (SAMD51)
        -   Arduino Mega form factor
    -   PyGamer (SAMD51)
        -   Made to be a game platform


<a id="orgbcb92e0"></a>

### Community

-   Learning guides on Adafruit (<https://learn.adafruit.com/>)
-   Discord server (<https://adafru.it/discord>)
-   Forums (<https://forums.adafruit.com/>)
-   Github (<https://github.com/adafruit/circuitpython>)


<a id="org4937465"></a>

## Questions

1.  Where can you buy the hardware?
    -   BJW Electronics in Moncton
    -   adafruit.com
    -   buyapi.ca
2.  Can it run Numpy?
    -   Maybe???
3.  Is there mechanisms for hardware interrupts?
    -   No, not yet, but it is supported in microPython
4.  Is there anything more than print statements for debugging? Maybe interactive debugging?
    -   No, there isn't due to resource restrictions.
    -   It is mostly just print statements.


<a id="orgad062d5"></a>

# Session 4: Securing the cloud: How not to end up in the news


<a id="org1603f55"></a>

## Info

-   Speaker: Matt Taylor
    -   Works at Akiri
-   slides: <https://github.com/matt-taylor-nb/securing-the-cloud>


<a id="org57e978b"></a>

## Summary

An overview of security tools available on AWS and how to use them.


<a id="org8b8cb75"></a>

## Notes:


<a id="org9dcc03e"></a>

### Why are we here?

-   This is about securing cloud platforms
-   This is not about writing secure code/applications
-   What will be covered:
    -   Look at some breaches
    -   Common security misconceptions
    -   Best practices
    -   Look at some AWS native tools
