Maritime-Devcon/MaritimeDevcon-2019.md


<a id="org97874ed"></a>

### Previous data breaches

1.  Reasons to use the cloud

    -   Easy
    -   cost efficient
    -   secure
    
    But is it that secure?

2.  Accenture

    -   Lost data from open S3 buckets
    -   Fixed it in one day

3.  GoDaddy

    -   Unprotected S3 bucket
    -   GoDaddy did not respond to the researcher

4.  SpyPhone

    -   Unprotected S3 Bucket

5.  Facebook

    -   third party company, 540+ Mil user accounts

6.  NS government

    -   Teen took advantage of Freedom of Information portal
    -   Incrementing id
    -   250 raw, unredacted documents were attained


<a id="org5e54ef8"></a>

### The Cloud really is secure

-   AWS itself hass never been compromised
-   All of the above mentioned breaches were the result of poor configurations
-   AWS provides the building blocks, they are secure, but people can use them in an insecure way.


<a id="org0bcfd1b"></a>

### What can we do?

-   Understand what your responsibility is in the Cloud
-   Ask lots of questions
-   Don't leave your s3 bucket open
    -   The default is now private (previously it was public)
-   remember that security is everyone's responsibility


<a id="orga5ba5bf"></a>

### Shared responsibility

-   AWS is responsible for security of the cloud
-   We are responsible for security in the cloud


<a id="orgfc4ff33"></a>

### Best practices

1.  AWS Account Setup

    -   Use a group email address
        -   This will be the root account, it will have access to everything
        -   If it is an individual email, that person will own the account
    -   Use a company phone number
    -   Configure alternate contact info
        -   Billing, security, etc
    -   Answer all Security Challenge Question
        -   For recovering the account.

2.  User Accounts

    -   Lock away the Root account
        -   It should only be used for initial setup
    -   Use individual IAM User accounts, NEVER share accounts.
        -   This will be used for day to day activities
        -   Assign permissions based on usage
        -   Permissions are granted as a white list, by default all permissions are denied
    -   Operate under a least privileged mode for accounts
    -   Assign permissions to groups and add users to groups
    -   Have a documented plan for user creation, permission change, and user removal

3.  Infrastructure

    -   Don't open to the public internet anything that doesn't need it
    -   Separate your workload into private networks
        -   Using VPCs
    -   Encrypt and backup your data
    -   Avoid snowflake deployments
        -   Keep your configuration in code
            -   EX/ Terraform
    -   Have an approval process for new infrastructure
        -   Doesn't need to be a huge thing, but a sanity check is good.
    -   Look up Service Best Practices
        -   There are 150 different services on AWS, know how to best use each of them
    -   Use instance profiles instead of credentials
        -   They work like user accounts in IAM
        -   It authenticates through the IAM service
        -   You can restrict access to different services
        -   Removes the need for hardcoded credentials

4.  Monitering/Auditing/Reporting

    -   CloudTrail, an infrastructure auditing service
        -   It records actions taken in AWS
    -   To get alerts from CloudTrail configure it to use cloudwatch
        -   You can use this to set alarms based on security events
    -   Use AWS Config
        -   Allows you to set AWS wide rules (Like banning public S3 buckets)
        -   It will send an alert when the rules are being broken
    -   Use Guard Duty
        -   AWS IDS
    -   Test your security

5.  Extra credit

    -   Use a third party service to test your security
    -   Verify the security of any 3rd parties that you trust your data with
        -   Many breaches come from third party companies
        -   It doesn't matter who the third party is, it is your data, you are responsible (that is how the public will see it)
    -   Use AssumeRole for access
        -   Cross-Account Access
        -   This is how you use multiple accounts
        -   You can have all logging in a separate account
    -   Use separate AWS Accounts for workload
        -   Different one for development, staging, and productio
    -   Trusted Advisor
        -   Gives advice on your setup.
        -   Tells you if you are violating best practices


<a id="org1acd709"></a>

## Questions

1.  When do we use AssumeRole?
    -   If you are using multiple accounts for managing AWS you should definitely look into AssumeRole.


<a id="orgbfae3b7"></a>

# Session 5: Short on time? Accelerate your data science with GPUs


<a id="org3870562"></a>

## Info

-   Speaker: Axel-Christion Guei
    -   Machine learning specialist at Teledyne Caris


<a id="org58fca8d"></a>

## Summary

A walkthrough of how using RAPIDS and GPUs can increase the productivity of data scientists.


<a id="org9562dca"></a>

## Notes:


<a id="orgad610d3"></a>

### When do you need a GPU?

-   When training a DNN
-   Playing video games
-   Mining bitcoin


<a id="orgf5338b5"></a>

### Challenge: Day in a life of a data scientist

1.  Goal: Identify astropysical sources in the night sky

2.  Datasets:

    -   set of metadata containing 11 features describing each object
    -   Time series observations with 6 features /object
    -   19 GB of data
    -   14 different astrophysical objects to detect.

3.  Tasks:

    -   Define performance goal
    -   Conduct data analysis and ETL
    -   Train several ML models
    
    ETL: Extract Transform Load
    
    -   Extract the data from a source
    -   Transform the data so it is meaningful
    -   Load the data into a destination

4.  A cause of slowness

    -   Too many data transfers between CPU and Memory

5.  A solutiong: GPUs

    -   Software stacks:
        -   Hadoop (job distribution framework)
        -   Spark (in-memory processing)
        -   Nvidia Rapids (GPU framework)
    -   Rapids loads the data directly into the GPU memory, so there is less overhead there.


<a id="orgbf523ff"></a>

### Performance

Using on GPU the data loading time is drastically reduced.
The GPU trained about 5 times faster than the CPU.


<a id="orgd5c0ce5"></a>

### RAPIDS Ecosystem

-   Numba
-   CuPy
-   Dask (allow jobs to be distributed)


<a id="org1d67a6e"></a>

### Conclusion

1.  Pros

    -   More than 100% performance boost
    -   More cost effective then large cpu clusters
    -   Easy integration with popular DL frameworks
    -   Highly scalable
    -   Python API available

2.  Cons

    -   High GPU memory usage
    -   cuDF does not cover all pandas API yet


<a id="org2089ee8"></a>

## Questions

1.  Can we use this on a GPU instance?
    -   Yes, there are images available on AWS


<a id="orgb53821a"></a>

# Session 6: How Design Systems can improve your design/engineering process


<a id="org71c64db"></a>

## Info

-   Speaker: Kolton Gagnon
    -   Works at Cvent


<a id="org03bb8df"></a>

## Summary

An overview of how you can use a design system to improve the consistency and efficiency of the design and development process.


<a id="org8233736"></a>

## Notes:


<a id="org40fad92"></a>

### When there is growth in a team

Without having a process in place for design there can be design rot. An increased team size can increase complexity.


<a id="org24d222d"></a>

### Design Systems

-   Figma
-   Highly reused components can be turned into master components.
-   Changes to the component will change in all instances of the component.
-   Changes can be published to your team

Using this there is increased efficiency, consistency, and structure
