Maritime-Devcon/MaritimeDevcon-2019.org
*** How to solve implementation issues
    - There are inconsistencies between the design and the code
    - Options:
      1) A components folder
         - What happens when more projects need to use these components?
         - Copy and pasting is probably going to happend
      2) Components Repo + NPM
         - That way the components can be installed by NPM
         - There are issues if the everything is in one NPM package then they all need to be upgraded with one version.
      3) How does React do it?
         - Use separate versions for each components in the repo
         - You can use Lerna to manage npm versions
*** Component documentation
    - Storybook creates a library for each and every component
    - You can change the props of a component using Knobs
    - Documentation can be embeded in notes
    - Figma designs can be integrated into storybook
** Questions
   1. Can you change the colour of your component based on where it is used?
      - Yes, you can set it to take a theme
* Session 7: Smart Community: What can we do to make this an actual reality
** Info
   - Speaker: Book Sadprasid
     - Works for Ignite Fredericton
** Summary
What Fredericton is doing to be a more tech savvy city
** Notes:
*** Smart city vs Smart Community
    - What is the difference?
      - Smart city: makes cities work better.
        - Greater efficiency in municipal services
        - focused on technology
      - Smart community: Making better cities
        - Make the lives of the citizens better
        - Focused on Community and growth
Smart communities use technology as a means to an end, putting more effort into
- Developing a workforce
- Crafting an innovation ecosystem
- Expanding access to digital skills and tech
- Engaging citizens and businesses

Smart communities are all about the people
*** Why become a smart community?
    - better parking
    - better energy management
    - better real-time services
*** What are we doing?
    - Digital Fredericton project
      - Putting more services online
      - Working with tech companies like Hotspot parking
*** What the taskforce is working on
**** Building on digital Fredericton
     - Establish development zones
       - labs, sandboxes, centres of excellence
     - Early adoption policies
     - Open data concepts
     - Align with academia
     - Analyze elements for economic growth
     - Digital product development zone
**** Digital product development living lab
Use the city of Fredericton as a test bed for tech companies
**** Collaborations and citizen involvement
     - Fred-e Hack
       - Smart city hackathon
       - using iot sensor network
* Session 8: fiasco.getInstance()
** Info
   - Speaker: Colin Casey
** Summary
** Notes:
*** Singleton design pattern
    - Protected constructor
    - Static getInstance() method
*** Drawbacks
    - Global state
    - Un-testable code
    - hidden dependencies
The singleton is an antipattern. 
*** What problem is it trying to solve?
In a project there can be a large object dependency graph.
Adding a singleton does not need to make large changes to that graph. The singleton is a dependency, but it will be hidden from you in that dependency graph.
*** How do you get around this problem?
Use dependency injection.
*** So why is it still used?
    - Managing objects is hard
    - :shrug: it works
*** Code with empathy
    - Your code will likely be used/maintained by others
    - Implementing a singleton may negatively impact one of those people.
    - Using a singleton is like peeing in the pool.
