Maritime-Devcon/MaritimeDevcon-2019.md


<a id="orgc027a37"></a>

### How to solve implementation issues

-   There are inconsistencies between the design and the code
-   Options:
    1.  A components folder
        -   What happens when more projects need to use these components?
        -   Copy and pasting is probably going to happend
    2.  Components Repo + NPM
        -   That way the components can be installed by NPM
        -   There are issues if the everything is in one NPM package then they all need to be upgraded with one version.
    3.  How does React do it?
        -   Use separate versions for each components in the repo
        -   You can use Lerna to manage npm versions


<a id="org7980f01"></a>

### Component documentation

-   Storybook creates a library for each and every component
-   You can change the props of a component using Knobs
-   Documentation can be embeded in notes
-   Figma designs can be integrated into storybook


<a id="orgd3da361"></a>

## Questions

1.  Can you change the colour of your component based on where it is used?
    -   Yes, you can set it to take a theme


<a id="org49a9db9"></a>

# Session 7: Smart Community: What can we do to make this an actual reality


<a id="org5891424"></a>

## Info

-   Speaker: Book Sadprasid
    -   Works for Ignite Fredericton


<a id="orgc866a1b"></a>

## Summary

What Fredericton is doing to be a more tech savvy city


<a id="orgf18f48f"></a>

## Notes:


<a id="orgdf0c8b3"></a>

### Smart city vs Smart Community

-   What is the difference?
    -   Smart city: makes cities work better.
        -   Greater efficiency in municipal services
        -   focused on technology
    -   Smart community: Making better cities
        -   Make the lives of the citizens better
        -   Focused on Community and growth

Smart communities use technology as a means to an end, putting more effort into

-   Developing a workforce
-   Crafting an innovation ecosystem
-   Expanding access to digital skills and tech
-   Engaging citizens and businesses

Smart communities are all about the people


<a id="org1b7af6d"></a>

### Why become a smart community?

-   better parking
-   better energy management
-   better real-time services


<a id="org652ffca"></a>

### What are we doing?

-   Digital Fredericton project
    -   Putting more services online
    -   Working with tech companies like Hotspot parking


<a id="org142de06"></a>

### What the taskforce is working on

1.  Building on digital Fredericton

    -   Establish development zones
        -   labs, sandboxes, centres of excellence
    -   Early adoption policies
    -   Open data concepts
    -   Align with academia
    -   Analyze elements for economic growth
    -   Digital product development zone

2.  Digital product development living lab

    Use the city of Fredericton as a test bed for tech companies

3.  Collaborations and citizen involvement

    -   Fred-e Hack
        -   Smart city hackathon
        -   using iot sensor network


<a id="org75a121e"></a>

# Session 8: fiasco.getInstance()


<a id="orgcda2a3b"></a>

## Info

-   Speaker: Colin Casey


<a id="org75225e7"></a>

## Summary


<a id="org534df95"></a>

## Notes:


<a id="org6ec1eaa"></a>

### Singleton design pattern

-   Protected constructor
-   Static getInstance() method


<a id="org350c474"></a>

### Drawbacks

-   Global state
-   Un-testable code
-   hidden dependencies

The singleton is an antipattern. 


<a id="org3d31fe9"></a>

### What problem is it trying to solve?

In a project there can be a large object dependency graph.
Adding a singleton does not need to make large changes to that graph. The singleton is a dependency, but it will be hidden from you in that dependency graph.


<a id="orgc8bca36"></a>

### How do you get around this problem?

Use dependency injection.


<a id="org7e457ec"></a>

### So why is it still used?

-   Managing objects is hard
-   :shrug: it works


<a id="orgffd1413"></a>

### Code with empathy

-   Your code will likely be used/maintained by others
-   Implementing a singleton may negatively impact one of those people.
-   Using a singleton is like peeing in the pool.

